#####################################例子#############################################
# 100以内的正整数求和
# sum = 0
# for i in range(1, 101):
#     # print(i, end=' ')
#     sum = sum + i
# print('100以内正整数求和为: {0}'.format(sum))

#####################################例子#############################################
# 普通闰年：公历年份是4的倍数，且不是100的倍数的，为闰年（如2004年、2020年等就是闰年）。
# 世纪闰年：公历年份是整百数的，必须是400的倍数才是闰年（如1900年不是闰年，2000年是闰年）。
# years = int(input('请输入年份(正整数): '))

# if (years % 4 == 0) and (years % 100 != 0):
#     print('{0} 是闰年.'.format(years))
# elif (years % 100 == 0) and (years % 400 == 0):
#     print('{0} 是闰年.'.format(years))
# else:
#     print('{0} 不是闰年.'.format(years))

#####################################例子#############################################
# 猜数字游戏
# import random
# sum = 0
# input_max = 0
# input_min = 0
# rand_int = random.randint(1,100)
# while True:
#     input_int = int(input("请输1-100正整数:"))
#     if input_int == rand_int:
#         sum += 1
#         print("恭喜你，输入正确! 猜测数字为: {0}, 猜测次数为: {1}".format(input_int, sum))
#         break
#     elif input_int > rand_int:
#         sum += 1
#         input_max = input_int
#         print("输入的大了!请输入大于 {0} 小于 {1}".format(input_min, input_max))
#         continue
#     else:
#         input_min = input_int
#         sum += 1
#         print("输入的小了!请输入大于 {0} 小于 {1}".format(input_min, input_max))
#         continue


#####################################例子#############################################
# 输出9*9乘法表
# sum = 0
# for i in range(1, 10):
#     for j in range(1, 10):
#         sum = i * j
#         print("{0} * {1} = {2}".format(j,i,sum),end=' ')
#         if i == j:
#             print()
#             break

#####################################例子#############################################
# 100以内的素数
# for i in range(2, 101):
#     for j in range(2, int(i/2)+1):
#         if i % j == 0:
#             break
#     else:
#         print(i, end=' ')

#####################################例子#############################################
# 输入一个正整数判断是不是素数
# input_int = int(input("请输正整数:"))
# for i in range(2, int(input_int/2)+1):
#     if input_int % i == 0:
#         print('{0} 不是素数!'.format(input_int))
#         break
# else:
#     print('{0} 是素数!'.format(input_int))

#####################################例子#############################################
# 打印如下所示的三角形图案
# *
# **
# ***
# ****
# *****

#     *
#    **
#   ***
#  ****
# *****

#     *
#    ***
#   *****
#  *******
# *********

# row = 5
# for i in range(0, row):
#     for j in range(0, row):
#         if  i >= j:
#             print("*", end='')
#         else:
#             print()
#             break
# print()
# print("==============================================")
# for i in range(row, 0, -1):
#     for j in range(1, row+1):
#         if  i <= j:
#             print("*", end='')
#         else:
#             print(" ", end='')
#     print()

# for i in range(row-1, 0, -1):
#     for j in range(0, row):
#         if i == j:
#             print('*')
#             break
#         else:
#             print(" ", end=' ')

# for i in range(0, row):
#     for j in range(row-1, -1, -1):
#         if j > i:
#             print(' ', end='')
#         else:
#             print((2*i+1) * '*')
#             break

#####################################例子#############################################
# 水仙花数：水仙花数也被称为超完全数字不变数、自恋数、自幂数、阿姆斯特朗数，它是一个3位数，该数字每个位上数字的立方之和正好等于它本身，例如：$1^3 + 5^3+ 3^3=153$。

# for i in range(100, 1000):
#     bai = i // 100
#     shi = (i // 10) % 10
#     ge = i % 10
#     if i == ((bai ** 3) + (shi ** 3) + (ge ** 3)):
#         print('{0}是水仙数!'.format(i))

#####################################例子#############################################
# 百钱百鸡:公鸡5元一只，母鸡3元一只，小鸡1元三只，用100块钱买一百只鸡，问公鸡、母鸡、小鸡各有多少只？
# for x in range(0, 20):
#     for y in range(0, 33):
#         z = 100 - x - y
#         if 5*x + 3*y + 1/3*z == 100:
#             print('{0}只公鸡,{1}只母鸡,{2}只小鸡'.format(x,y,z))

#####################################例子#############################################
# 生成**斐波那契数列**的前20个数
# 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144,

# x = 0
# y = 1
# for i in range(0, 20):
#     if x == 1 and y == 1:
#         print(1)
#     x,y = y, x+y
#     print('{0}'.format(y))

#####################################例子#############################################
# 找出10000以内的完美数。它的所有的真因子（即除了自身以外的因子）的和（即因子函数）恰好等于它本身。

# for i in range(10000):
#     sum = 0
#     for j in range(1, i):
#         if i % j == 0:
#             sum = sum + j
#     if i == sum:
#         print('{0}是完美数'.format(i))

#####################################例子#############################################
# 用函数的方式实现阶乘









